--------------------------------------------------------------------------------
Makelog started: 2023-09-29 12:07:53
Working directory: /Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis
--------------------------------------------------------------------------------
Input links successfully created!
External links successfully created!
Source logs successfully written!
WARNING! The following target files have been modified according to git status:
/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/data/output/cleaned_nmr_gender_specific.RDS
/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/data/output/cleaned_nmr_gender_specific.csv
Version logs successfully written!
Executing command: `Rscript --no-save "/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis/code/figure_a.R"`
National mortality rates by gender have been loaded... 
Figure A data has been compiled... 
Figure A has been mapped and exported... 
 
 
##### FIGURE A COMPILATION COMPLETED ##### 
 
 

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.2     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.1     
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

Attaching package: ‘gridExtra’

The following object is masked from ‘package:dplyr’:

    combine

Warning messages:
1: Using `size` aesthetic for lines was deprecated in ggplot2 3.4.0.
ℹ Please use `linewidth` instead. 
2: The `size` argument of `element_rect()` is deprecated as of ggplot2 3.4.0.
ℹ Please use the `linewidth` argument instead. 

Executing command: `Rscript --no-save "/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis/code/figure_b.R"`
National mortality rates by gender have been loaded... 
Figure B data has been compiled... 
Figure B has been mapped and exported... 
 
 
##### FIGURE B COMPILATION COMPLETED ##### 
 
 

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.2     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.1     
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

Attaching package: ‘gridExtra’

The following object is masked from ‘package:dplyr’:

    combine

Warning messages:
1: Using `size` aesthetic for lines was deprecated in ggplot2 3.4.0.
ℹ Please use `linewidth` instead. 
2: The `size` argument of `element_rect()` is deprecated as of ggplot2 3.4.0.
ℹ Please use the `linewidth` argument instead. 

Executing command: `Rscript --no-save "/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis/code/figure_c.R"`
Age-specific national mortality rates by gender have been loaded... 
Figure C data has been compiled... 
Figure C has been mapped and exported... 
 
 
##### FIGURE C COMPILATION COMPLETED ##### 
 
 

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.2     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.1     
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

Attaching package: ‘gridExtra’

The following object is masked from ‘package:dplyr’:

    combine

Warning messages:
1: Using `size` aesthetic for lines was deprecated in ggplot2 3.4.0.
ℹ Please use `linewidth` instead. 
2: The `size` argument of `element_rect()` is deprecated as of ggplot2 3.4.0.
ℹ Please use the `linewidth` argument instead. 

Executing command: `Rscript --no-save "/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis/code/figure_d.R"`
Age-specific national mortality rates by gender have been loaded... 
Figure D data has been compiled... 
Figure D has been mapped and exported... 
 
 
##### FIGURE D COMPILATION COMPLETED ##### 
 
 

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.2     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.1     
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

Attaching package: ‘gridExtra’

The following object is masked from ‘package:dplyr’:

    combine

Warning messages:
1: Using `size` aesthetic for lines was deprecated in ggplot2 3.4.0.
ℹ Please use `linewidth` instead. 
2: The `size` argument of `element_rect()` is deprecated as of ggplot2 3.4.0.
ℹ Please use the `linewidth` argument instead. 


  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core , expiring 21 Jul 2024
Serial number: 501809310346
  Licensed to: Sameer Nair-Desai
               SIEPR

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do "/Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis/code/sig_tests.do
> " 

. * Construct t-tests for sig. differences in mortality rates
. 
. ****************
. ** AGE GROUPS **
. *****************
. 
. import excel using input/raw_nmr_gender.xlsx, firstrow clear
(13 vars, 127 obs)

. 
. * Clean data
. drop Notes YearCode Deaths *95Con*

. drop if Year == .
(1 observation deleted)

. destring Population, replace force
Population already numeric; no replace

. destring CrudeRateStandardError, replace force
CrudeRateStandardError already numeric; no replace

. 
. * Converting standard errors to standard deviations.
. gen CrudeRateSD = CrudeRateStandardError * sqrt(Population)

. 
. destring CrudeRate, replace
CrudeRate already numeric; no replace

. 
. * Keep first and last year 
. keep if Year == 2007 | Year == 2020
(108 observations deleted)

. 
. keep if TenYearAgeGroups == "55-64 years" | ///
>         TenYearAgeGroups == "65-74 years" | ///
>         TenYearAgeGroups == "75-84 years"
(6 observations deleted)

.         
. replace TenYearAgeGroups = "75+" if TenYearAgeGroups == "75-84 years"
(4 real changes made)

. 
. gen GenderAge = TenYearAgeGroups + ": " + GenderCode

. drop Gender GenderCode TenYearAgeGroups TenYearAgeGroupsCode

. 
. reshape wide Crude* Population, i(GenderAge) j(Year)
(j = 2007 2020)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               12   ->   6           
Number of variables                   6   ->   9           
j variable (2 values)              Year   ->   (dropped)
xij variables:
                              CrudeRate   ->   CrudeRate2007 CrudeRate2020
                 CrudeRateStandardError   ->   CrudeRateStandardError2007 Crude
> RateStandardError2020
                            CrudeRateSD   ->   CrudeRateSD2007 CrudeRateSD2020
                             Population   ->   Population2007 Population2020
-----------------------------------------------------------------------------

. 
. * Rates by age bins:
. 
. gen t_test_agegroup = (CrudeRate2020 - CrudeRate2007) /  sqrt((CrudeRateSD202
> 0^2 / Population2020) + (CrudeRateSD2007^2 / Population2007))

. 
. export delimited using output/t_tests_agegroup.csv, replace
(file output/t_tests_agegroup.csv not found)
file output/t_tests_agegroup.csv saved

. 
. ************
. ** GENDER **
. ************
. 
. * import data for female/male age-adjusted and crude mortality rates
. import delimited using input/cleaned_nmr_gender.csv, clear
(encoding automatically selected: ISO-8859-2)
(14 vars, 43 obs)

. 
. * Clean data
. keep if gender == "Male" | gender == "Female"
(15 observations deleted)

. 
. * Converting sample size to numeric.
. gen population_numeric = real(subinstr(us_time_period_pop, ",", "", .))

. format population_numeric %12.0f

. 
. * Converting standard errors to standard deviations.
. gen raw_death_rate_sd = raw_death_rate_se * sqrt(population_numeric)

. gen age_adj_death_rate_sd = age_adj_death_rate_se * sqrt(population_numeric)

. 
. keep time_period gender raw_death_count raw_death_rate raw_death_rate_sd age_
> adj_death_rate age_adj_death_rate_sd population_numeric

. 
. * Keep first and last year 
. keep if time_period == "2007" | time_period == "2020" 
(24 observations deleted)

. 
. * Reshape to perform t-test
. reshape wide raw_death_* age_adj_* pop*, i(gender) j(time_period) string
(j = 2007 2020)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations                4   ->   2           
Number of variables                   8   ->   13          
j variable (2 values)       time_period   ->   (dropped)
xij variables:
                        raw_death_count   ->   raw_death_count2007 raw_death_co
> unt2020
                         raw_death_rate   ->   raw_death_rate2007 raw_death_rat
> e2020
                      raw_death_rate_sd   ->   raw_death_rate_sd2007 raw_death_
> rate_sd2020
                     age_adj_death_rate   ->   age_adj_death_rate2007 age_adj_d
> eath_rate2020
                  age_adj_death_rate_sd   ->   age_adj_death_rate_sd2007 age_ad
> j_death_rate_sd2020
                     population_numeric   ->   population_numeric2007 populatio
> n_numeric2020
-----------------------------------------------------------------------------

. 
. * Welch's T-Test for crude rates by gender:
. 
. gen t_test_raw = (raw_death_rate2020 - raw_death_rate2007) / sqrt((raw_death_
> rate_sd2020^2 / population_numeric2020) + (raw_death_rate_sd2007^2 / populati
> on_numeric2007))

. 
. * Next, age-adjusted rates by gender:
. 
. gen t_test_ageadj = (age_adj_death_rate2020 - age_adj_death_rate2007) / sqrt(
> (age_adj_death_rate_sd2020^2 / population_numeric2020) + (age_adj_death_rate_
> sd2007^2 / population_numeric2007))

. 
. export delimited using output/t_tests_gender.csv, replace
(file output/t_tests_gender.csv not found)
file output/t_tests_gender.csv saved

. 
. ***************************
. ** GENDER AND AGE GROUPS **
. ***************************
. 
. import delimited using input/cleaned_nmr_gender_specific.csv, varnames(1) cle
> ar
(encoding automatically selected: ISO-8859-2)
(11 vars, 127 obs)

. 
. * Clean data
. keep time_period gender age_groups age_specific_death_rate age_specific_death
> _rate_se us_time_period_pop

. 
. * Converting sample size to numeric.
. gen population_numeric = real(subinstr(us_time_period_pop, ",", "", .))

. format population_numeric %12.0f

. 
. keep if age_groups == "55-64 years" | ///
>         age_groups == "65-74 years" | ///
>         age_groups == "75-84 years"
(43 observations deleted)

.         
. replace age_groups = "75+" if age_groups == "75-84 years"
(28 real changes made)

. 
. destring age_specific_death_rate, replace
age_specific_death_rate already numeric; no replace

. destring age_specific_death_rate_se, replace
age_specific_death_rate_se already numeric; no replace

. 
. * Converting standard errors to standard deviations.
. gen age_specific_death_rate_sd = age_specific_death_rate_se * sqrt(population
> _numeric)

. 
. keep if gender == "Male" | gender == "Female"
(0 observations deleted)

. 
. * Keep first and last year
. tostring time_period, replace force
time_period already string; no replace

. keep if time_period == "2007" | time_period == "2020"
(72 observations deleted)

. 
. gen GenderAge = gender + ": " + age_groups

. drop gender age_groups us_time_period_pop

. 
. reshape wide age_specific_death* pop*, i(GenderAge) j(time_period) string
(j = 2007 2020)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               12   ->   6           
Number of variables                   6   ->   9           
j variable (2 values)       time_period   ->   (dropped)
xij variables:
                age_specific_death_rate   ->   age_specific_death_rate2007 age_
> specific_death_rate2020
             age_specific_death_rate_se   ->   age_specific_death_rate_se2007 a
> ge_specific_death_rate_se2020
             age_specific_death_rate_sd   ->   age_specific_death_rate_sd2007 a
> ge_specific_death_rate_sd2020
                     population_numeric   ->   population_numeric2007 populatio
> n_numeric2020
-----------------------------------------------------------------------------

. 
. * Rates by age bins (and gender): 
. destring age_specific_death_rate2020, replace force
age_specific_death_rate2020 already numeric; no replace

. destring age_specific_death_rate2007, replace force
age_specific_death_rate2007 already numeric; no replace

. destring age_specific_death_rate_se2020, replace force
age_specific_death_rate_se2020 already numeric; no replace

. destring age_specific_death_rate_se2007, replace force
age_specific_death_rate_se2007 already numeric; no replace

. 
. gen t_test_gender_age = (age_specific_death_rate2020 - age_specific_death_rat
> e2007)/sqrt(age_specific_death_rate_se2020^2 + age_specific_death_rate_se2007
> ^2)

. 
. export delimited using output/t_tests_gender_age.csv, replace
(file output/t_tests_gender_age.csv not found)
file output/t_tests_gender_age.csv saved

. 
end of do-file

Output logs successfully written!
--------------------------------------------------------------------------------
Makelog ended: 2023-09-29 12:08:13
Working directory: /Users/sameernair-desai/Desktop/IndRes/CJD_Epi/analysis
--------------------------------------------------------------------------------
